Merge pull request #19 from Skyscanner/dev
CDM
